<template>
  <div>
    <a-card class="user-agreement" :bordered="false">
      <a-card-meta>
        <div class="user-agreement-title" slot="title">用户协议</div>
        <div slot="description">
          <van-collapse v-model="activeNames">
            <van-collapse-item name="1">
              <span class="user-agreement-item-title" slot="title">
                账号注册以及使用规则
              </span>
              <ul>
                <li>
                  用户注册或授权登录成功后，本平台将给予每个用户创建一个账户并分配一个用户标识符；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
                </li>
                <li>
                  用户须对在本平台的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；否则本平台有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。
                </li>
                <li>
                  用户直接或通过各类方式（如 RSS 源和站外 API引用等）间接使用本平台服务和数据的行为，都将被视作已无条件接受本协议全部内容；若用户对本协议的任何条款存在异议，请停止使用本平台所提供的全部服务。
                </li>
                <li>
                  本平台是一个信息发布、传播及获取的平台，用户通过本平台发表的信息为公开的信息，其他第三方均可以通过本平台获取用户发表的信息，用户对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何用户不愿被其他第三人获知的信息都不应该在本平台上进行发表。
                </li>
                <li>
                  用户承诺不得以任何方式利用本平台直接或间接从事违反中国法律以及社会公德的行为，本平台有权对违反上述承诺的内容予以删除。
                </li>
                <li>
                  用户不得利用本平台服务制作、上载、复制、发布、传播或者转载如下内容：
                  <p>
                    (1) 反对宪法所确定的基本原则的； (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
                    (3) 损害国家荣誉和利益的； (4) 煽动民族仇恨、民族歧视，破坏民族团结的； (5) 侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的；
                    (6) 破坏国家宗教政策，宣扬邪教和封建迷信的； (7) 散布谣言，扰乱社会秩序，破坏社会稳定的； (8) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
                    (9) 侮辱或者诽谤他人，侵害他人合法权益的； (10) 含有法律、行政法规禁止的其他内容的信息。
                  </p>
                </li>
                <li>所有用户同意遵守《社区规范》。</li>
                <li>
                  本平台有权对用户使用本平台的情况进行审查和监督，如用户在使用本平台时违反任何上述规定，本平台或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户发布的内容、暂停或终止用户使用本平台的权利）以减轻用户不当行为造成的影响。
                </li>
              </ul>
            </van-collapse-item>
            <van-collapse-item name="2">
              <span class="user-agreement-item-title" slot="title">
                个人隐私
              </span>
              <p>
                尊重用户个人隐私信息的私有性是本平台的一贯原则，本平台将通过技术手段、强化内部管理等办法充分保护用户的个人隐私信息，除法律或有法律赋予权限的政府部门要求或事先得到用户明确授权等原因外，本平台保证不对外公开或向第三方透露用户个人隐私信息，或用户在使用服务时存储的非公开内容。同时，为了运营和改善本平台的技术与服务，本平台将可能会自行收集使用或向第三方提供用户的非个人隐私信息，这将有助于本平台向用户提供更好的用户体验和服务质量。
              </p>
            </van-collapse-item>
            <van-collapse-item name="3">
              <span class="user-agreement-item-title" slot="title">
                侵权举报
              </span>
              <p>
                <strong>处理原则</strong>
                ：本平台作为信息共享社区，高度重视自由表达和个人、企业正当权利的平衡。依照法律规定删除违法信息是本平台社区的法定义务，本平台社区亦未与任何中介机构合作开展此项业务。
              </p>
              <p><br /></p>
              <p>
                <strong>受理范围</strong>
                ：受理本平台社区内侵犯企业或个人合法权益的侵权举报，包括但不限于涉及个人隐私、造谣与诽谤、商业侵权。（1）涉及个人隐私：发布内容中直接涉及身份信息，如个人姓名、家庭住址、身份证号码、工作单位、私人电话等详细个人隐私；（2）造谣、诽谤：发布内容中指名道姓（包括自然人和企业）的直接谩骂、侮辱、虚构中伤、恶意诽谤等；（3）商业侵权：泄露企业商业机密及其他根据保密协议不能公开讨论的内容。
              </p>
              <p><br /></p>
              <p>
                <strong>举报条件</strong>
                ：用户在本平台发表的内容仅表明其个人的立场和观点，并不代表本平台的立场或观点。如果个人或企业发现本平台上存在侵犯自身合法权益的内容，可以先尝试与作者取得联系，通过沟通协商解决问题。如您无法联系到作者，或无法通过与作者沟通解决问题，您可通过点击内容右上角的举报按钮来向本平台平台进行投诉。为了保证问题能够及时有效地处理，请务必提交真实有效、完整清晰的材料，否则投诉将无法受理。您需要向本平台提供的投诉材料包括：（1）权利人对涉嫌侵权内容拥有商标权、著作权和/或其他依法可以行使权利的权属证明，权属证明通常是营业执照或组织机构代码证；（2）举报人的身份证明，身份证明可以是身份证或护照；（3）如果举报人非权利人，请举报人提供代表权利人进行举报的书面授权证明。（4）为确保投诉材料的真实性，在侵权举报中，您还需要签署以下法律声明：a
                我本人为所举报内容的合法权利人；b
                我举报的发布在本平台社区中的内容侵犯了本人相应的合法权益；c
                如果本侵权举报内容不完全属实，本人将承担由此产生的一切法律责任，并承担和赔偿本平台因根据投诉人的通知书对相关帐号的处理而造成的任何损失，包括但不限于本平台因向被投诉方赔偿而产生的损失及本平台名誉、商誉损害等。
              </p>
              <p><br /></p>
              <p>
                <strong>处理流程</strong>
                ：（1）出于网络平台的监督属性，并非所有申请都必须受理。本平台收到举报后的处理期间，不提供任何电话、邮件及其他方式的查询服务。（2）出现本平台已经删除或处理的内容，但是百度、谷歌等搜索引擎依然可以搜索到的现象，是因为百度、谷歌等搜索引擎自带缓存，此类问题本平台无权也无法处理，因此相关申请不予受理。您可以自行联系搜索引擎服务商进行处理。（3）此为本平台社区唯一的官方侵权投诉渠道，暂不提供其他方式处理此业务
              </p>
            </van-collapse-item>
            <van-collapse-item name="4">
              <span class="user-agreement-item-title" slot="title">
                知识产权
              </span>
              <p>
                本平台是一个信息获取、发布及传播的平台，我们尊重和鼓励本平台用户创作的内容，认识到保护知识产权对本平台生存与发展的重要性，承诺将保护知识产权作为本平台运营的基本原则之一。
              </p>
              <ul>
                <li>
                  用户在本平台上发表的全部原创内容（包括但不仅限于文章和评论），著作权均归用户本人所有。用户可授权第三方以任何方式使用，不需要得到本平台的同意。
                </li>
                <li>
                  本平台提供的网络服务中包含的标识、版面设计、排版方式、文本、图片、图形等均受著作权、商标权及其它法律保护，未经相关权利人（含本平台及其他原始权利人）同意，上述内容均不得在任何平台被直接或间接发布、使用、出于发布或使用目的的改写或再发行，或被用于其他任何商业目的。
                </li>
                <li>
                  为了促进知识的分享和传播，用户将其在本平台上发表的全部内容，授予本平台免费的、不可撤销的、非独家使用许可，本平台有权将该内容用于本平台各种形态的产品和服务上，包括但不限于网站、公众号、小程序以及发表的应用或其他互联网产品。
                </li>
                <li>
                  未征得用户同意，任何第三方不得转载（包括但不限于原文复制、截屏）用户在本平台发布的内容，否则均视为侵权。
                </li>
                <li>
                  在本平台上传或发表的内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，本平台有权根据实际情况删除相关的内容，且有权追究用户的法律责任。给本平台或任何第三方造成损失的，用户应负责全额赔偿。
                </li>
                <li>
                  如果任何第三方侵犯了本平台用户相关的权利，用户同意授权本平台或其指定的代理人代表本平台自身或用户对该第三方提出警告、投诉、发起行政执法、诉讼、进行上诉，或谈判和解，并且用户同意在本平台认为必要的情况下参与共同维权。
                </li>
                <li>
                  本平台有权但无义务对用户发布的内容进行审核，有权根据相关证据结合法律法规及本平台规范对侵权信息进行处理。
                </li>
              </ul>
            </van-collapse-item>
            <van-collapse-item name="5">
              <span class="user-agreement-item-title" slot="title">
                免责声明
              </span>
              <ol>
                <li>本平台不能对用户发表的二手物品的质量进行保证。</li>
                <li>
                  用户在本平台发表的内容仅表明其个人的立场和观点，并不代表本平台的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。本平台不承担任何法律及连带责任。
                </li>
                <li>
                  本平台不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作保证。
                </li>
                <li>
                  对于因不可抗力或本平台不能控制的原因造成的网络服务中断或其它缺陷，本平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
                </li>
              </ol>
            </van-collapse-item>
          </van-collapse>

          <div class="foot">
            <p>
              根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，本平台有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，本平台将会直接在本平台网站上公布修改之后的协议内容，该公布行为视为本平台已经通知用户修改内容。本平台也可采用站内发帖通知、弹窗等传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。
            </p>
            <p><br /></p>
            <p>
              如果不同意本平台对本协议相关条款所做的修改，用户有权并应当停止使用本平台。如果用户继续使用本平台，则视为用户接受本平台对本协议相关条款所做的修改。
            </p>
            <div style="text-align: center; margin-top: 25px">
              <span style="color: #888888; font-size: 12px"> - THE END - </span>
            </div>
          </div>
        </div>
      </a-card-meta>
    </a-card>
  </div>
</template>

<script>
export default {
  data() {
    return {
      activeNames: ["1", "2", "3", "4", "5"],
    };
  },
};
</script>

<style scoped>
.user-agreement {
  width: 100%;
}
.user-agreement-title {
  font-size: 18px;
  font-weight: 800;
  padding: 10px;
  text-align: center;
}
.user-agreement-item-title {
  font-size: 16px;
  font-weight: 600;
}
.foot {
  margin-left: 15px;
  margin-right: 15px;
  margin-bottom: 150px;
  margin-top: 20px;
  color: #666;
}
</style>